src/Documents/инкВедомостьНаВыплатуЗарплаты/инкВедомостьНаВыплатуЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>инкВедомостьНаВыплатуЗарплаты</name>
  <attributes>
    <name>ВидВедомости</name>
    <type>
      <types>EnumRef.инкВидВедомостиНаВыплатуЗарплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.инкНачислениеЗарплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗарплатныйПроект</name>
    <type>
      <types>CatalogRef.инкЗарплатныеПроекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРеестра</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.инкОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.инкПодразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВыплатыЗарплаты</name>
    <type>
      <types>EnumRef.инкСпособыВыплатыЗарплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматОбменаСБанкамиПоЗарплатнымПроектам</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Зарплата</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.инкСотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>КВыплате</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыУдержаний</name>
    <attributes>
      <name>Удержание</name>
      <type>
        <types>ChartOfCalculationTypesRef.инкУдержания</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/инкВидВедомостиНаВыплатуЗарплаты/инкВидВедомостиНаВыплатуЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>инкВидВедомостиНаВыплатуЗарплаты</name>
  <enumValues>
    <name>ВКассу</name>
  </enumValues>
  <enumValues>
    <name>ВБанк</name>
  </enumValues>
</mdclass:Enum>

src/Enums/инкСпособыВыплатыЗарплаты/инкСпособыВыплатыЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>инкСпособыВыплатыЗарплаты</name>
  <enumValues>
    <name>Зарплата</name>
  </enumValues>
  <enumValues>
    <name>Аванс</name>
  </enumValues>
  <enumValues>
    <name>ПоВидамУдержаний</name>
  </enumValues>
</mdclass:Enum>

src/ChartsOfCalculationTypes/инкУдержания/инкУдержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>инкУдержания</name>
  <baseCalculationTypes>ChartOfCalculationTypes.инкНачисления</baseCalculationTypes>
  <baseCalculationTypes>ChartOfCalculationTypes.инкУдержания</baseCalculationTypes>
  <predefined>
    <items>
      <name>Аванс</name>
      <description>Аванс</description>
    </items>
    <items>
      <name>Алименты</name>
      <description>Алименты</description>
    </items>
    <items>
      <name>ВыплатаОтпускныхИБЛВТекущемМесяце</name>
      <description>Выпл. отпуск. и б/л в текущем месяце</description>
    </items>
    <items>
      <name>ДобровольныеВзносы</name>
      <description>Добровольные взносы</description>
    </items>
    <items>
      <name>Долг</name>
      <description>Долг</description>
    </items>
    <items>
      <name>ЗарплатаПредыдущегоМесяца</name>
      <description>Зарплата предыдущего месяца</description>
    </items>
    <items>
      <name>ЗарплатаТекущегоМесяца</name>
      <description>Зарплата текущего месяца</description>
    </items>
    <items>
      <name>ЗарплатаТекущегоМесяцаДо22</name>
      <description>Зарплата текущего месяца до 22</description>
    </items>
    <items>
      <name>ЗарплатаТекущегоМесяцаПосле22</name>
      <description>Зарплата текущего месяца после 22</description>
    </items>
    <items>
      <name>ИсполнительныйЛист</name>
      <description>Исполнительный лист</description>
    </items>
    <items>
      <name>МежрасчетныеВыплаты</name>
      <description>Межрасчетные выплаты</description>
    </items>
    <items>
      <name>НДФЛ</name>
      <description>НДФЛ</description>
    </items>
    <items>
      <name>Подарки</name>
      <description>Подарки</description>
    </items>
    <items>
      <name>ПрофсоюзныйВзнос</name>
      <description>Профсоюзный взнос</description>
    </items>
    <items>
      <name>ПрочиеУдержания</name>
      <description>Прочие удержания</description>
    </items>
  </predefined>
  <attributes>
    <name>ВПроцентах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Кредит</name>
    <type>
      <types>ChartOfAccountsRef.инкХозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>КодВСтаройПрограмме</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:ChartOfCalculationTypes>

src/Documents/инкВедомостьНаВыплатуЗарплаты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ЭтотОбъект.СуммаДокумента = ЭтотОбъект.Зарплата.Итог("КВыплате");
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ВидВедомости) Тогда
		ЭтотОбъект.ВидВедомости = Перечисления.инкВидВедомостиНаВыплатуЗарплаты.ВБанк;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область о // Заполнение объекта:

Процедура ЗаполнитьВыплатуЗарплаты(ПараметрыЗаполнения,ПервичноеЗаполнение = Ложь) Экспорт
	
	Если ПервичноеЗаполнение Тогда

		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПараметрыЗаполнения);                  
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПараметрыЗаполнения.ДокументОснование);                  
		ЭтотОбъект.ВидВедомости = Перечисления.инкВидВедомостиНаВыплатуЗарплаты.ВКассу;
		ЭтотОбъект.Номер = "";
		
		Сотрудники = ПараметрыЗаполнения.ДокументОснование.Ведомость.ВыгрузитьКолонку("Сотрудник"); 
		
		ЭтотОбъект.ВидыУдержаний.Очистить();
		Для каждого ВидУдержанияЭлемент Из ПараметрыЗаполнения.ВидыУдержаний Цикл
			ВидУдержанияСтрока = ЭтотОбъект.ВидыУдержаний.Добавить();
			ВидУдержанияСтрока.Удержание = ВидУдержанияЭлемент;
		КонецЦикла;  
		
	КонецЕсли;   
	
	// Дата выплаты:
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ДатаВыплаты) Тогда
		
		ЧислоМесяцаВыплатыЗарплаты = Организация.ЧислоМесяцаВыплатыЗарплаты;
		Если НЕ ЗначениеЗаполнено(ЧислоМесяцаВыплатыЗарплаты) Тогда
			ЧислоМесяцаВыплатыЗарплаты = 15;	
		КонецЕсли;
		ЭтотОбъект.ДатаВыплаты = НачалоМесяца(ПараметрыЗаполнения.ДокументОснование.МесяцНачисления) + 60*60*24*ЧислоМесяцаВыплатыЗарплаты;

		Если ПараметрыЗаполнения.СпособВыплатыЗарплаты = Перечисления.инкСпособыВыплатыЗарплаты.Аванс Тогда	
			ЭтотОбъект.ДатаВыплаты = КонецМесяца(ПараметрыЗаполнения.ДокументОснование.МесяцНачисления) - 60*60*24;
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнениеСтруктура = Новый Структура;	
	ЗаполнениеСтруктура.Вставить("ДокументОснование",ПараметрыЗаполнения.ДокументОснование);
	Если ЭтотОбъект.ВидВедомости = Перечисления.инкВидВедомостиНаВыплатуЗарплаты.ВБанк Тогда
		ЗаполнениеСтруктура.Вставить("ЗарплатныйПроект",ЭтотОбъект.ЗарплатныйПроект);	
	КонецЕсли;
	Если ПараметрыЗаполнения.СпособВыплатыЗарплаты = Перечисления.инкСпособыВыплатыЗарплаты.Зарплата Тогда
		ЗаполнениеСтруктура.Вставить("ВидыУдержаний", ПланыВидовРасчета.инкУдержания.ЗарплатаПредыдущегоМесяца);
	ИначеЕсли ПараметрыЗаполнения.СпособВыплатыЗарплаты = Перечисления.инкСпособыВыплатыЗарплаты.Аванс Тогда                  
		ЗаполнениеСтруктура.Вставить("ВидыУдержаний", ПланыВидовРасчета.инкУдержания.Аванс);
	Иначе
		ЗаполнениеСтруктура.Вставить("ВидыУдержаний",ЭтотОбъект.ВидыУдержаний.ВыгрузитьКолонку("Удержание"));	
	КонецЕсли;
	
	ВедомостьНаВыплатуЗарплатыТаблица = инкВедомостиСервер.ПолучитьВедомостьПоУдержаниям(ЗаполнениеСтруктура);
	
	ЭтотОбъект.Зарплата.Очистить();
	Для каждого ВедомостьСтрока Из ВедомостьНаВыплатуЗарплатыТаблица Цикл
		
		Если ВедомостьСтрока.КВыплате <> 0 Тогда
			ЗарплатаСтрока = ЭтотОбъект.Зарплата.Добавить();
			ЗаполнитьЗначенияСвойств(ЗарплатаСтрока,ВедомостьСтрока);
		КонецЕсли;
		
	КонецЦикла;             
	
	Если ЭтотОбъект.НомерРеестра = 0 Тогда
		ЭтотОбъект.НомерРеестра = 1;	
	КонецЕсли; 
	
	ЭтотОбъект.СуммаДокумента = ЭтотОбъект.Зарплата.Итог("КВыплате");
	
КонецПроцедуры

#КонецОбласти				

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
